---
kind: other
id: Methods.T:Autodesk.Revit.DB.SpatialElementFromToCalculationPoints
source: html/423c2c28-5aca-0e33-df56-1745613bc6b9.htm
---
# SpatialElementFromToCalculationPoints Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.